# Query Homework MySQL

### Soal 1
1) Tampilkan daftar 10 kota terpadat di Indonesia. Urutkan data dari kota dengan populasi terbanyak.
- Kolom yang diwajibkan tampil adalah id kota, nama kota, kode negara, distrik/provinsi dan populasi.

### Jawaban 1
- select * from city
- where CountryCode = 'IDN'
- order by population desc
- limit 10;

---
### Soal 2

2) Tampilkan daftar 10 kota terpadat di dunia beserta asal negaranya. Urutkan data dari kota dengan populasi terbanyak.
- Kolom yang diwajibkan ada minimal adalah id kota, nama kota, distrik/provinsi, nama negara dan populasi.

### Jawaban 2

- select ID, city.name as Nama_Kota, District, country.name as Negara, city.Population
    - from city
    - inner join country on
    - city.countrycode = country.code
    - order by population desc
    - limit 10;
    
- select a.id, a.name as nama_kota, a.district, b.name as negara, a.population
    - from city as a, country as b
    - where a.countrycode = b.code
    - order by population desc
    - limit 10

---
### Soal 3
3) Tampilkan daftar 10 negara yang tercatat merdeka paling awal. Daftar negara yang tidak diketahui tahun kemerdekaannya, tidak perlu diikutsertakan.
- Kolom yang diwajibkan ada minimal adalah kode negara, nama negara, benua, regional dan tahun merdeka (Independence Year).

### Jawaban 3
- select code, name, continent, region, indepyear as tahun_merdeka from country
    - where indepyear != 0
    - order by indepyear asc
    - limit 10;

---
### Soal 4

4) Tampilkan daftar benua yang memiliki lebih dari 10 negara di dalamnya.
- Kolom yang ditampilkan minimal: nama benua, jumlah negara di dalam benua, total populasi dan rata-rata angka harapan hidup (Life Expectancy) kemudian urutkan dari benua yang memiliki populasi terbanyak.

### Jawaban 4

- select Continent as Benua, count(name) as Jumlah_Negara, sum(population) as Populasi, avg(LifeExpectancy) as Rata_AngkaHrpnHdp
    - from country
    - group by continent
    - having populasi > 10
    - order by populasi desc;

---
### Soal 5

5) Tampilkan daftar negara-negara Asia yang memiliki angka harapan hidup lebih dari rata-rata angka harapan hidup negara-negara Eropa.
- Kolom yang diwajibkan ada yaitu nama negara, nama benua, angka harapan hidup dan Pendapatan Nasional Bruto/GNP (Gross National Product). Urutkan data dari negara Asia dengan angka harapan hidup tertinggi.

### Jawaban 5

- select name as Nama, continent as Benua, LifeExpectancy as AngkaHarapanHidup, GNP
    - from country
    - where continent = 'Asia' and LifeExpectancy >
    - (select avg(LifeExpectancy) from country where continent = 'Europe')
    - order by AngkaHarapanHidup desc;

---
### Soal 6

6) Tampilkan daftar 10 negara yang bahasa resminya (official language) adalah bahasa Inggris, dan memiliki persentase pengguna bahasa Inggris tertinggi di dunia.
- Kolom yang diwajibkan ada yaitu kode negara, nama negara, bahasa, kolom isOfficial dan percentage. Urutkan dari persentase pengguna bahasa Inggris tertinggi.

### Answer 6

- select countrycode, name, language, IsOfficial, Percentage
    - from countrylanguage
    - inner join country on
    - countrylanguage.countrycode = country.code
    - where language = 'English' and IsOfficial = 'T'
    - order by percentage desc
    - limit 10;

---
### Soal 7

7) Tampilkan daftar negara ASEAN beserta populasi negaranya, Pendapatan Nasional Bruto/GNP (Gross National Product), ibukota & populasi ibukota.
- Kolom yang diwajibkan ada yaitu nama negara, populasi negara, pendapatan nasional bruto (GNP), nama ibukota dan populasi ibukota. Urutkan berdasarkan abjad nama negara.

### Jawaban 7

- select country.name as Negara_ASEAN, country.Population as Populasi_Negara, GNP, city.name as Ibukota, city.population as Populasi_Ibukota
    - from country
    - inner join city on
    - country.capital = city.id
    - where region = 'Southeast Asia'
    - group by country.name
    - order by country.name asc;
    
- select co.Name as Negara_Asean, co.Population as Populasi_Negara, GNP, ci.Name as Ibukota, ci.population as Populasi_Ibukota
    - from country co
    - left join city ci on
    - co.capital = ci.id
    - where co.region = 'southest asia'
    - order by Negara_Asean;

---
### Soal 8

8) Tampilkan daftar negara G20 beserta populasi negaranya, Pendapatan Nasional Bruto/GNP (Gross National Product), ibukota & populasi ibukota.
- Kolom yang diwajibkan ada yaitu nama negara, populasi negara, pendapatan nasional bruto (GNP), nama ibukota dan populasi ibukota. Urutkan berdasarkan abjad nama negara.

### Jawaban 8

- select country.name as Negara_G20, country.Population as Populasi_Negara, GNP, city.name as Ibukota, city.population as Populasi_Ibukota
    - from country
    - inner join city on
    - country.capital = city.id
    - where GNP > 
    - (select avg(GNP) from country)
    - order by country.name asc
    - limit 20;

---
## **MySQL Python**
---

In [1]:
import mysql.connector
import pandas as pd

### Create Connection

In [4]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'qwerty',
    database = 'toko'
)

### Acces Tables in Database

In [5]:
mycursor = mydb.cursor()
query = 'select * from karyawan'

mycursor.execute(query)
myresult = mycursor.fetchall()
print(myresult)

[(1, 'Andi Santosa', 32, 68.3, 'Jakarta', 2010, None), (2, 'Budi Permana', 32, 88.1, 'Jakarta', 1999, None), (3, 'Cecep Sutisna', 35, 68.9, 'Bandung', 2000, None), (4, 'Dedi Hartanto', 32, 71.3, 'Salatiga', 1998, None), (5, 'Eva Soraya', 32, 48.1, 'Medan', 2015, None), (6, 'Farah Naimah', 29, 52.3, 'Surabaya', 2010, None), (7, 'Gianti Safitri', 22, 51.6, 'Bandung', 2017, None), (8, 'Hamzah Syah', 34, 66.0, 'Yogyakarta', 2008, None), (9, 'Irene Sukindar', 25, 49.3, 'Jakarta', 2016, None), (10, 'Joni Saputra', 28, 69.8, 'Yogyakarta', 2000, None), (11, 'Budi Raharja', 52, 70.0, 'Jakarta', 1998, None), (12, 'Andi Raharja', 35, 67.0, 'Jakarta', 2018, None)]

In [7]:
columns = mycursor.column_names
columns

('No', 'Nama', 'Usia', 'Berat', 'Kota', 'Th', 'Data_In')

In [8]:
df = pd.DataFrame(myresult, columns=columns)
df

    No            Nama  Usia  Berat        Kota    Th Data_In
0    1    Andi Santosa    32   68.3     Jakarta  2010    None
1    2    Budi Permana    32   88.1     Jakarta  1999    None
2    3   Cecep Sutisna    35   68.9     Bandung  2000    None
3    4   Dedi Hartanto    32   71.3    Salatiga  1998    None
4    5      Eva Soraya    32   48.1       Medan  2015    None
5    6    Farah Naimah    29   52.3    Surabaya  2010    None
6    7  Gianti Safitri    22   51.6     Bandung  2017    None
7    8     Hamzah Syah    34   66.0  Yogyakarta  2008    None
8    9  Irene Sukindar    25   49.3     Jakarta  2016    None
9   10    Joni Saputra    28   69.8  Yogyakarta  2000    None
10  11    Budi Raharja    52   70.0     Jakarta  1998    None
11  12    Andi Raharja    35   67.0     Jakarta  2018    None

In [9]:
mydb_world = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'qwerty',
    database = 'world'
)

In [22]:
mycursor1 = mydb_world.cursor()
query1 = """
select code, name, continent, region, indepyear as tahun_merdeka from country 
where indepyear != 0 order by indepyear asc limit 10
"""
mycursor1.execute(query1)
myresult1 = mycursor1.fetchall()
df_world = pd.DataFrame(myresult1, columns = mycursor1.column_names)
df_world

  code            name continent            region  tahun_merdeka
0  CHN           China      Asia      Eastern Asia          -1523
1  ETH        Ethiopia    Africa    Eastern Africa          -1000
2  JPN           Japan      Asia      Eastern Asia           -660
3  DNK         Denmark    Europe  Nordic Countries            800
4  SWE          Sweden    Europe  Nordic Countries            836
5  FRA          France    Europe    Western Europe            843
6  SMR      San Marino    Europe   Southern Europe            885
7  GBR  United Kingdom    Europe   British Islands           1066
8  PRT        Portugal    Europe   Southern Europe           1143
9  AND         Andorra    Europe   Southern Europe           1278

In [23]:
mycursor2 = mydb_world.cursor()
query2 = """
select name as Nama, continent as Benua, LifeExpectancy as AngkaHarapanHidup, GNP from country 
where continent = "Asia" and LifeExpectancy > (select avg(LifeExpectancy) from country where continent = "Europe") 
order by AngkaHarapanHidup desc
"""
mycursor2.execute(query2)
myresult2 = mycursor2.fetchall()
df_world1 = pd.DataFrame(myresult2, columns = mycursor2.column_names)
df_world1

        Nama Benua  AngkaHarapanHidup        GNP
0      Macao  Asia               81.6     5749.0
1      Japan  Asia               80.7  3787042.0
2  Singapore  Asia               80.1    86503.0
3  Hong Kong  Asia               79.5   166448.0
4     Israel  Asia               78.6    97477.0
5     Jordan  Asia               77.4     7526.0
6     Cyprus  Asia               76.7     9333.0
7     Taiwan  Asia               76.4   256254.0
8     Kuwait  Asia               76.1    27037.0